app/controllers/movies_controller.rb

  def index
    session["init"] = true
    @change_date = false
    @change_title = false
    @all_ratings = Movie.allratings()
    @all_checked = true
    @cache = Hash.new()
    if (params[:sort_by] == nil and params[:ratings] == nil and !session.has_key?(:sort_by) and !session.has_key?(:ratings))
      params[:ratings] = Hash[@all_ratings.zip  Array.new(@all_ratings.size,1)]
      session[:ratings] = params[:ratings]
    elsif (params[:ratings] == nil and params[:sort_by] == nil and session.has_key?(:ratings))
      params[:ratings] = session[:ratings]
      params[:sort_by] = session[:sort_by]
      flash.keep
      redirect_to movies_path(:sort_by => session[:sort_by], :ratings => session[:ratings])
    end
    if (params[:sort_by] != nil and session.has_key?(:ratings)) #sort_by chosen, ratings is not overrided
      params[:ratings] = session[:ratings] #happen only when sort_by is chosen
    end
    if (params[:sort_by] == nil and session.has_key?(:sort_by)) #sort by not chosen but there is one at the past
      params[:sort_by] = session[:sort_by] #happen when only ratings are chosen
    end

    ratings = params[:ratings].keys

    if (params[:ratings] and params[:sort_by])
      @movies = Movie.find(:all,:conditions=>{:rating => ratings}, :order => params[:sort_by])
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 0]]